; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	image0 - mode
	thermograph1 - mode
	infrared3 - mode
	thermograph4 - mode
	thermograph2 - mode
	Star0 - direction
	Star5 - direction
	GroundStation7 - direction
	Star10 - direction
	Star9 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation11 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	Star8 - direction
	GroundStation1 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 infrared3)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 Star9)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 image0)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation11)
	(calibration_target instrument2 Star8)
	(supports instrument3 thermograph2)
	(supports instrument3 thermograph4)
	(supports instrument3 infrared3)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 thermograph2)
	(supports instrument4 thermograph4)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation7)
)
(:goal (and
	(have_image Star12 thermograph2)
	(have_image Phenomenon13 thermograph2)
	(have_image Phenomenon14 image0)
	(have_image Planet15 infrared3)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 4
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 4
3. (turn_to satellite1 phenomenon14 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 phenomenon14)
   goals met: 0 of 4
4. (turn_to satellite0 phenomenon13 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon13)
   goals met: 0 of 4
5. (turn_to satellite1 star8 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 star8)
   goals met: 0 of 4
6. (calibrate satellite1 instrument2 star8)
   added: (calibrated instrument2)
   goals met: 0 of 4
7. (turn_to satellite1 phenomenon14 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 phenomenon14)
   goals met: 0 of 4
8. (take_image satellite1 phenomenon14 instrument2 image0)
   added: (have_image phenomenon14 image0)
   goals met: 1 of 4
9. (turn_to satellite1 planet15 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 planet15)
   goals met: 1 of 4
10. (take_image satellite1 planet15 instrument2 infrared3)
   added: (have_image planet15 infrared3)
   goals met: 2 of 4
11. (turn_to satellite0 star2 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star2)
   goals met: 2 of 4
12. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 2 of 4
13. (turn_to satellite0 phenomenon13 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 4
14. (take_image satellite0 phenomenon13 instrument1 thermograph2)
   added: (have_image phenomenon13 thermograph2)
   goals met: 3 of 4
15. (turn_to satellite0 star12 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star12)
   goals met: 3 of 4
16. (take_image satellite0 star12 instrument1 thermograph2)
   added: (have_image star12 thermograph2)
   goals met: 4 of 4
